In [1]:
import pandas as pd
weather_data = {"day":["1/1/2019","1/2/2019","1/3/2019","1/4/2019","1/5/2019","1/6/2019"],"temperature":[32,35,28,40,34,25],
                "windspeed":[6,7,4,7,5,6],"event":["rain","sunny","rain","hot","sunny","cold"]}

In [2]:
df = pd.DataFrame(weather_data)

In [3]:
df

        day  temperature  windspeed  event
0  1/1/2019           32          6   rain
1  1/2/2019           35          7  sunny
2  1/3/2019           28          4   rain
3  1/4/2019           40          7    hot
4  1/5/2019           34          5  sunny
5  1/6/2019           25          6   cold

In [4]:
df.shape

(6, 4)

In [5]:
rows , columns = df.shape

In [6]:
rows

6

In [7]:
columns

4

In [8]:
cs = pd.read_csv("countries.csv")
cs.tail()

       country  year  population
1699  Zimbabwe  1987     9216418
1700  Zimbabwe  1992    10704340
1701  Zimbabwe  1997    11404948
1702  Zimbabwe  2002    11926563
1703  Zimbabwe  2007    12311143

In [9]:
cs.head()

       country  year  population
0  Afghanistan  1952     8425333
1  Afghanistan  1957     9240934
2  Afghanistan  1962    10267083
3  Afghanistan  1967    11537966
4  Afghanistan  1972    13079460

In [10]:
cs.head(1)

       country  year  population
0  Afghanistan  1952     8425333

In [11]:
cs[2:5]

       country  year  population
2  Afghanistan  1962    10267083
3  Afghanistan  1967    11537966
4  Afghanistan  1972    13079460

In [12]:
cs["population"]

0        8425333
1        9240934
2       10267083
3       11537966
4       13079460
5       14880372
6       12881816
7       13867957
8       16317921
9       22227415
10      25268405
11      31889923
12       1282697
13       1476505
14       1728137
15       1984060
16       2263554
17       2509048
18       2780097
19       3075321
20       3326498
21       3428038
22       3508512
23       3600523
24       9279525
25      10270856
26      11000948
27      12760499
28      14760787
29      17152804
          ...
1674     9657618
1675    11219340
1676    13367997
1677    15826497
1678    18701257
1679    22211743
1680     2672000
1681     3016000
1682     3421000
1683     3900000
1684     4506497
1685     5216550
1686     6100407
1687     7272406
1688     8381163
1689     9417789
1690    10595811
1691    11746035
1692     3080907
1693     3646340
1694     4277736
1695     4995432
1696     5861135
1697     6642107
1698     7636524
1699     9216418
1700    10704340
1701    11404948
1702    11926563
1703    12311143
Name: population, Length: 1704, dtype: int64

In [13]:
cs.columns

Index(['country', 'year', 'population'], dtype='object')

In [14]:
cs.year

0       1952
1       1957
2       1962
3       1967
4       1972
5       1977
6       1982
7       1987
8       1992
9       1997
10      2002
11      2007
12      1952
13      1957
14      1962
15      1967
16      1972
17      1977
18      1982
19      1987
20      1992
21      1997
22      2002
23      2007
24      1952
25      1957
26      1962
27      1967
28      1972
29      1977
        ...
1674    1982
1675    1987
1676    1992
1677    1997
1678    2002
1679    2007
1680    1952
1681    1957
1682    1962
1683    1967
1684    1972
1685    1977
1686    1982
1687    1987
1688    1992
1689    1997
1690    2002
1691    2007
1692    1952
1693    1957
1694    1962
1695    1967
1696    1972
1697    1977
1698    1982
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [15]:
cs.population

0        8425333
1        9240934
2       10267083
3       11537966
4       13079460
5       14880372
6       12881816
7       13867957
8       16317921
9       22227415
10      25268405
11      31889923
12       1282697
13       1476505
14       1728137
15       1984060
16       2263554
17       2509048
18       2780097
19       3075321
20       3326498
21       3428038
22       3508512
23       3600523
24       9279525
25      10270856
26      11000948
27      12760499
28      14760787
29      17152804
          ...
1674     9657618
1675    11219340
1676    13367997
1677    15826497
1678    18701257
1679    22211743
1680     2672000
1681     3016000
1682     3421000
1683     3900000
1684     4506497
1685     5216550
1686     6100407
1687     7272406
1688     8381163
1689     9417789
1690    10595811
1691    11746035
1692     3080907
1693     3646340
1694     4277736
1695     4995432
1696     5861135
1697     6642107
1698     7636524
1699     9216418
1700    10704340
1701    11404948
1702    11926563
1703    12311143
Name: population, Length: 1704, dtype: int64

In [16]:
df

        day  temperature  windspeed  event
0  1/1/2019           32          6   rain
1  1/2/2019           35          7  sunny
2  1/3/2019           28          4   rain
3  1/4/2019           40          7    hot
4  1/5/2019           34          5  sunny
5  1/6/2019           25          6   cold

In [17]:
type(df["event"])

pandas.core.series.Series

In [18]:
df[["event","day"]] # if i want to print any two columns

   event       day
0   rain  1/1/2019
1  sunny  1/2/2019
2   rain  1/3/2019
3    hot  1/4/2019
4  sunny  1/5/2019
5   cold  1/6/2019

In [19]:
df["temperature"].max()

40

In [20]:
df["temperature"].min()

25

In [21]:
df["temperature"].std()

5.316640543300503

In [22]:
df["temperature"].mean()

32.333333333333336

In [23]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     32.333333   5.833333
std       5.316641   1.169045
min      25.000000   4.000000
25%      29.000000   5.250000
50%      33.000000   6.000000
75%      34.750000   6.750000
max      40.000000   7.000000

In [24]:
df[df.temperature>=40]

        day  temperature  windspeed event
3  1/4/2019           40          7   hot

In [25]:
df[df.temperature==df.temperature.max()]

        day  temperature  windspeed event
3  1/4/2019           40          7   hot

In [26]:
#or 
df[df.temperature==df["temperature"].max()]

        day  temperature  windspeed event
3  1/4/2019           40          7   hot

In [27]:
# if i want to print any thing from the row of this (max) temperature
df[["day","temperature"]][df.temperature==df.temperature.max()]

        day  temperature
3  1/4/2019           40

In [28]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [29]:
df.set_index("day") # it returns the new dataframe ,it doesnt modify the original one

          temperature  windspeed  event
day
1/1/2019           32          6   rain
1/2/2019           35          7  sunny
1/3/2019           28          4   rain
1/4/2019           40          7    hot
1/5/2019           34          5  sunny
1/6/2019           25          6   cold

In [30]:
df

        day  temperature  windspeed  event
0  1/1/2019           32          6   rain
1  1/2/2019           35          7  sunny
2  1/3/2019           28          4   rain
3  1/4/2019           40          7    hot
4  1/5/2019           34          5  sunny
5  1/6/2019           25          6   cold

In [31]:
df.set_index("day",inplace = True) # for modifying the original one

In [32]:
df

          temperature  windspeed  event
day
1/1/2019           32          6   rain
1/2/2019           35          7  sunny
1/3/2019           28          4   rain
1/4/2019           40          7    hot
1/5/2019           34          5  sunny
1/6/2019           25          6   cold

In [33]:
df.loc["1/1/2019"]

temperature      32
windspeed         6
event          rain
Name: 1/1/2019, dtype: object

In [35]:
df.reset_index(inplace = True)

In [36]:
df

        day  temperature  windspeed  event
0  1/1/2019           32          6   rain
1  1/2/2019           35          7  sunny
2  1/3/2019           28          4   rain
3  1/4/2019           40          7    hot
4  1/5/2019           34          5  sunny
5  1/6/2019           25          6   cold

In [37]:
df.set_index("event",inplace =True)

In [38]:
df

            day  temperature  windspeed
event
rain   1/1/2019           32          6
sunny  1/2/2019           35          7
rain   1/3/2019           28          4
hot    1/4/2019           40          7
sunny  1/5/2019           34          5
cold   1/6/2019           25          6

In [41]:
df.loc["sunny"]

            day  temperature  windspeed
event
sunny  1/2/2019           35          7
sunny  1/5/2019           34          5